#Задайте список из n чисел последовательности (1+ 1/n)^n и выведите на экран их сумму (округляйте до 3 знаков после запятой).
#*Пример:*
# Для n = 6: [2, 2.25, 2.37, 2.441, 2.488, 2.522]
# Вывод: 14.031 (2 + 2.25 + 2.37 + 2.441 + 2.448 + 2.522)

a_int = int(input("Enter the number: "))

int_list = []

for i in range(1, a_int + 1):
    int_list.append( int(round( ( (1 + 1/i) ** i), 0)))
 
print(f"For n = {a_int}: {int_list} -> {sum(int_list)}")